# Pandas-IV

In [5]:
import pandas as pd
data={'a' : [1,2,3,4],
      'b':[5,6,7,8],
      'c':["rose","flower","mango","apple"]
     }

df=pd.DataFrame(data)
df

   a  b       c
0  1  5    rose
1  2  6  flower
2  3  7   mango
3  4  8   apple

In [7]:
df1=pd.DataFrame(data,index=['a1','b1','c1','d1'])

In [9]:
df1

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [13]:
df1.reindex(['b1','c1','d1','a1'])

    a  b       c
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple
a1  1  5    rose

In [15]:
df1

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [17]:
df1.iterrows()

In [21]:
for i in df1.iterrows():
    print(i)

('a1', a       1
b       5
c    rose
Name: a1, dtype: object)
('b1', a         2
b         6
c    flower
Name: b1, dtype: object)
('c1', a        3
b        7
c    mango
Name: c1, dtype: object)
('d1', a        4
b        8
c    apple
Name: d1, dtype: object)

In [23]:
for i ,j in df1.iterrows():
    print(i,j)

a1 a       1
b       5
c    rose
Name: a1, dtype: object
b1 a         2
b         6
c    flower
Name: b1, dtype: object
c1 a        3
b        7
c    mango
Name: c1, dtype: object
d1 a        4
b        8
c    apple
Name: d1, dtype: object

# items

In [28]:
df1

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [38]:
df1.items()

In [43]:
for i in df1.items():
    print(i)

('a', a1    1
b1    2
c1    3
d1    4
Name: a, dtype: int64)
('b', a1    5
b1    6
c1    7
d1    8
Name: b, dtype: int64)
('c', a1      rose
b1    flower
c1     mango
d1     apple
Name: c, dtype: object)

In [47]:
for i ,j in df1.items():
    print(i,j)

a a1    1
b1    2
c1    3
d1    4
Name: a, dtype: int64
b a1    5
b1    6
c1    7
d1    8
Name: b, dtype: int64
c a1      rose
b1    flower
c1     mango
d1     apple
Name: c, dtype: object

In [49]:
df1

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [51]:
def xyz(x):
    return x.sum()

df1.apply(xyz)

a                      10
b                      26
c    roseflowermangoapple
dtype: object

In [55]:
df2=df1[['a','b']]

In [57]:
df2

    a  b
a1  1  5
b1  2  6
c1  3  7
d1  4  8

In [65]:
df2.map(lambda x:x**2)

     a   b
a1   1  25
b1   4  36
c1   9  49
d1  16  64

In [67]:
df1

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [77]:
df1.sort_values('c',ascending=True)

    a  b       c
d1  4  8   apple
b1  2  6  flower
c1  3  7   mango
a1  1  5    rose

In [79]:
df1.sort_index()

    a  b       c
a1  1  5    rose
b1  2  6  flower
c1  3  7   mango
d1  4  8   apple

In [81]:
df1.sort_index(ascending=False)

    a  b       c
d1  4  8   apple
c1  3  7   mango
b1  2  6  flower
a1  1  5    rose

In [95]:
import pandas as pd

data2 = {
    "Description": [
        "Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches."
    ]
}

df2=pd.DataFrame(data2)
df2

                                         Description
0  Data science is an interdisciplinary field tha...

In [99]:
pd.set_option('display.max_colwidth',500)
df3=pd.DataFrame({
    "Description": [
        "Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches."
    ]
})
df3

                                                                                                                                                                                                                                                                                                 Description
0  Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches.

In [101]:
pd.set_option('display.max_colwidth',500)
df3=pd.DataFrame({
    "Description": [
        "Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches.","Python is english language","datascience is a robust"
    ]
})
df3

                                                                                                                                                                                                                                                                                                 Description
0  Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches.
1                                                                                                                                                                                                                                                                                 Python is english language
2                                                                                                                                                                                                                                                                                    datascience is a robust

In [103]:
df3['lenght']=df3['Description'].apply(len)

In [105]:
df3

,Description,lenght
0,"Data science is an interdisciplinary field that combines techniques from statistics, computer science, mathematics, and information science to extract knowledge and insights from structured and unstructured data. It aims to understand and analyze real-world phenomena using data-driven approaches.",297
1,Python is english language,26
2,datascience is a robust,23